system/ab_test.txt
=== notes tests apache bench - ab ===


On va pouvoir utiliser l'outil ab issus des outils apache pour bencher les réponses d'un site ..

 yum install -y httpd-tools.x86_64
 ab --help

 on va pouvoir tester les reponses grace a des options fournies 

exemple : 

-c X : nombre de requettes concurrentes
-n X : nombre de requettes 
-H "XXX" : setting de headers particulier si nécéssaire



 ab -r -c 10 -n 2000 -H "Host: api-test" http://192.168.1.7/api-test/ok.php

b -n 100 -c 2 https://www.google.fr/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.google.fr (be patient).....done


Server Software:        gws
Server Hostname:        www.google.fr
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        www.google.fr

Document Path:          /
Document Length:        11188 bytes

Concurrency Level:      2
Time taken for tests:   3.128 seconds
Complete requests:      100
Failed requests:        96
   (Connect: 0, Receive: 0, Length: 96, Exceptions: 0)
Total transferred:      1197611 bytes
HTML transferred:       1123111 bytes
Requests per second:    31.97 [#/sec] (mean)
Time per request:       62.551 [ms] (mean)
Time per request:       31.275 [ms] (mean, across all concurrent requests)
Transfer rate:          373.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       17   20   1.2     19      23
Processing:    35   41   3.9     41      58
Waiting:       34   41   3.8     40      58
Total:         53   61   4.1     60      77

Percentage of the requests served within a certain time (ms)
  50%     60
  66%     62
  75%     62
  80%     63
  90%     66
  95%     70
  98%     76
  99%     77
 100%     77 (longest request)